// מערך הילדים לאימוץ
let children = [
    { name: 'גל', age: 3, pic: './pic/3 (2).png', shortDescrip: 'ילד חייכן ואוהב טבע', description: `גל גדל במוסד לאחר שאימו לא יכלה להמשיך ולטפל בו. הוא ילד חייכן, אוהב טבע ויציאה לטיולים. גל נהנה מאוד ממשחקים בחוץ ותחביבו הגדול הוא להכיר חיות וללמוד עליהן. הוא מחפש משפחה אוהבת שתקבל אותו עם כל ליבו ותעניק לו בית חם ותומך בו יוכל להרגיש בטוח ושמח.`, budget: 4100 },
    { name: 'קלארה', age: 2, pic: './pic/3 (5).png', shortDescrip: 'מלאת חן וסקרנות', description: `קלארה נולדה לבית קשה מאוד, שבו לא יכלו להעניק לה את הטיפול הדרוש. מאז שנמצאת במערכת האימוץ, קלארה מפגינה סקרנות גדולה כלפי העולם, חיוך מתוק ונשמה רגישה. היא מחפשת משפחה שתעניק לה חום, אהבה וביטחון, ותאפשר לה לגלות את העולם בקצב שלה.`, budget: 3600 },
    { name: 'קמירו', age: 4, pic: './pic/fd.webp', shortDescrip: 'ילד שאפתן עם חלומות גדולים', description: `קמירו הוא ילד עם רצון עז להצליח וללמוד, שגדל במוסד חינוכי לאחר שאביו נטש את המשפחה ואמו נאלצה לוותר עליו בגלל קשיים בריאותיים חמורים. קמירו מצטיין בלימודים ואוהב לקרוא ספרים על מדע וטכנולוגיה, החלום שלו הוא להיות מהנדס ולבנות מכוניות. הוא ילד חברתי, אוהב לעזור לחבריו ושואף תמיד להיות הטוב ביותר. קמירו זקוק למשפחה שתתמוך בשאיפותיו ותעניק לו בית יציב ומלא באהבה, מקום שבו יוכל להרגיש בטוח ולקבל השראה להגשמת חלומותיו.`, budget: 4400 },
    { name: 'אלה', age: 4, pic: './Pic/אלה.webp', shortDescrip: 'מתחנן לבית', description: `אלה היא ילדה מקסימה שנולדה למשפחה מתפרקת, כשהוריה התמודדו עם קשיים כלכליים ורגשיים שהובילו לויתור עליה בגיל צעיר מאוד. אלה מפגינה סקרנות גדולה כלפי העולם שסביבה, אוהבת לגלות וללמוד, אוהבת לשחק ולעזור לאחרים. היא ילדה חמה ומלאת אהבה, מחפשת את החיבוק המשפחתי שיספק לה ביטחון ויציבות. בחייה הקצרים היא כבר הראתה את עוצמת האופי שלה ואת הרצון להצליח, וכעת היא מחפשת משפחה שתחבק ותאפשר לה לפרוח בכל תחום.`, budget: 3900 },
    { name: 'דביר', age: 6, pic: './Pic/ניקולאס.webp', shortDescrip: 'ילד חכם עם לב סגור, מחפש מי שיפתח אותו בעדינות', description: 'דביר, בן 6, הגיע אלינו לאחר רצף של חוויות חיים קשות. הוא נולד לאם יחידנית שחוותה אלימות, וגדל בסביבה לא יציבה רגשית. נדד בין מסגרות, התקשה לפתח אמון, והפך לילד סגור וזהיר.למרות הקשיים, דביר ילד חד אבחנה עם יכולת התבוננות נדירה. הוא אוהב לבנות, לשחק בלגו, ומתחבר מאוד לחיות. הצוות מתאר אותו כילד עמוק, שכשמרגיש בטוח- חושף צדדים עדינים ומלאי חמלה.הוא זקוק למשפחה רגישה ובשלה שתדע להכיל את הקצב שלו, ותהיה מוכנה ללוות אותו בתהליך ארוך של ריפוי וצמיחה.', budget: 5100 },
    { name: 'מתיו', age: 1, pic: './Pic/מתיו.png', shortDescrip: 'תינוק עדין עם עיניים מחכימות', description: 'מתיו נולד במשפחה שקרסה כלכלית וחברתית, אמו הייתה במצב של דיכאון קשה שהשפיע על היכולת שלה לטפל בו. כבר מהלידה מתיו היה תינוק רגוע, עם עיניים גדולות וסקרניות, שמסוגלות להאיר כל חדר בו הוא נמצא. למרות הקשיים שעמדו מולו, מתיו מפגין רצון חיים אדיר וצורך עמוק באהבה ותשומת לב. הוא מחפש היום משפחה יציבה שתוכל להעניק לו בית חם, שקט ומלא באהבה, מקום שבו יוכל לפרוח ולהרגיש מוגן. התינוק הקטן זקוק לסביבה מכילה שתכיל את הרוך והרגישות הטבעית שלו ותאפשר לו להתפתח לפי הקצב הייחודי שלו', budget: 3550 },
    { name: 'מרי', age: 5, pic: './Pic/מרי.webp', shortDescrip: 'ילדה שקטה עם עיניים שמספרות סיפור שלם', description: `מרי בת 5, ילדה עדינה מאוד שלא מדברת כמעט – לא מתוך קושי שפתי, אלא מתוך שברון לב. היא גדלה בסביבה מוזנחת רגשית, בלי חיבוק, בלי מילה טובה. אמא הייתה נוכחת-נפקדת, ואבא נעדר מהתמונה. כשהגיעה למרכז החירום, לקח לה שבועות עד שאמרה מילה ראשונה – "מים". מאז, לאט לאט, נבנה הקשר. היא מתקשרת בעיקר דרך ציורים ושירים שהיא ממציאה לעצמה. המטפלות שלה מספרות על עולם פנימי עשיר, ועל ילדה שזקוקה למסגרת מאוד יציבה, עקבית ורכה. למרות הקושי, מרי מגלה סקרנות גדולה וסבלנות יוצאת דופן. יש בה המון פוטנציאל רגשי ויצירתי. היא פשוט צריכה מישהו שיאמין בה.`, budget: 4700 },
    { name: 'מרקו', age: 'חצי שנה', pic: './Pic/מרקו.webp', shortDescrip: 'תינוק חייכן ומלא תקווה', description: `מרקו נולד בתנאים מאתגרים מאוד, כשהוריו לא יכלו לשמור עליו עקב קשיים רפואיים ומצב כלכלי קשה. הוא תינוק עם חיוך כובש ועיניים שמלאות סקרנות ואור. מרקו אוהב להיות מחובק ולשמוע קולות רכים ומרגיעים. הוא זקוק למשפחה שתקבל אותו בזרועות פתוחות, תעניק לו את החום והאהבה שהעולם לא נתן לו עד כה, ותספק לו את הבסיס להמשך חיים בריאים ומאושרים.`, budget: 3600 },
    { name: 'אן ואווה', age: 3, pic: './Pic/אן ואווה.webp', shortDescrip: 'תאומים חמודים עם אישיות חזקה', description: `אן ואווה הם תאומים מלאי חיים ואישיות חזקה. הם עברו מסכת חיים לא פשוטה, הם גדלו בבית עם הורים שנאלצו לוותר עליהם עקב בעיות רפואיות מורכבות. אן הוא ילד חברותי ואקטיבי, אווה היא ילדה רגועה ומתבוננת. הם מחפשים משפחה שתקבל ותתמוך בשונות שלהם, ותעניק להם את ההזדמנות לגדול יחד בסביבה אוהבת ובטוחה.`, budget: 5800 },
    { name: 'אמילי', age: 5, pic: './Pic/אמילי.webp', shortDescrip: 'ילדה עם לב ענק', description: `אמילי היא ילדה מקסימה עם תסמונת דאון, שגדלה במוסד חינוכי לאחר שננטשה על ידי הוריה הביולוגיים כשהייתה תינוקת. החיים לא פשוטים עבורה, אך היא מפגינה כוח נפשי יוצא דופן, שמחת חיים מדבקת ואופטימיות נדירה. אמילי אוהבת לשיר, לרקוד ולצייר ציורים צבעוניים שמספרים את סיפורה האישי. היא מלאת חום, תמיד מחפשת חיבוק, ועם כל אתגר שהחיים מציבים בפניה, היא מגיבה בחיוך גדול ואהבה עצומה. אמילי זקוקה למשפחה המסורה שתבין את הצרכים הייחודיים שלה, ותתן לה את התמיכה הטיפולית והרגשית הדרושה לה כדי שתוכל לממש את מלוא הפוטנציאל שלה, ולהרגיש שייכת ואהובה באמת.`, budget: 5000 },
    { name: 'ליאם', age: 'new born', pic: './Pic/ליאם.webp', shortDescrip: 'תינוק קטן עם התחלה חדשה', description: `ליאם נולד בבית חולים גדול במרכז הארץ לפני יומיים. אמו הייתה צעירה, כבת 19, והייתה במצב נפשי קשה שלא אפשר לה להמשיך בהריון. המשפחה הקרובה ניסתה לתמוך אך המצב הכלכלי והחברתי שלה היה קשה במיוחד. ליאם הוא תינוק רגוע ושקט, עם עיניים סקרניות שמביטות על העולם החדש סביבו. למרות גילו הצעיר, יש בו תחושת אמיץ וחיוניות שמאירים את סביבתו. כיום הוא מחפש משפחה שתגלה לו חום, יציבות ואהבה, שתעניק לו הזדמנות להתחיל את חייו בדרך הטובה ביותר.`, budget: 3500 },
    { name: 'ג`ק ואמה', age: 6, pic: './Pic/ג`ק ואמה.webp', shortDescrip: 'זוג תאומים מלאי חיים ואהבה', description: 'ג`ק ואמה הם זוג תאומים מדהימים בעלי תסמונת דאון שנולדו לזוג צעיר שעמד בפני אתגרים רבים שהובילו לויתור עליהם. מאז לידתם הם חיים בבית אומנה, אך תמיד ביחד – קשר מיוחד של תאומים שאינו ניתן להפרדה. הם ילדים מלאים חיים, סקרנים ומלאי אנרגיה, שאוהבים לשחק יחד, לחקור ולגלות את העולם שמסביבם. ג`ק הוא ילד רגוע יותר, אוהב חיבוקים וסיפורים לפני השינה, בעוד אמה היא שובבה, אוהבת לצחוק ולהמציא משחקים חדשים. שני התאומים מחפשים משפחה אוהבת שתדע לקבל אותם כפי שהם, עם כל הצרכים והייחודיות שלהם, ותספק להם בית חם ובטוח שבו יוכלו לגדול ולהתפתח יחדיו.', budget: 7500 },
    { name: 'סול', age: 4, pic: './Pic/רוני.webp', shortDescrip: 'ילדה עדינה ומלאת עומק', description: `סול היא ילדה מתוקה, שקטה ועמוקה במבטה. היא נולדה במשפחה שבה ההורים היו צעירים וקשה היה להם לטפל בה. בעקבות הקשיים, הוחלט להעבירה לאימוץ כדי שתוכל לגדול בסביבה בטוחה ואוהבת. היא זקוקה לזמן הסתגלות במפגש עם אנשים חדשים, אך כאשר היא נפתחת היא יוצרת קשר חם ומרגש. סול אוהבת לשחק במשחקי דמיון וליצור בעבודות יד, ומחפשת משפחה שתעניק לה סביבה רגועה ותומכת שבה תוכל לפרוח.`, budget: 4200 },
    { name: 'נבו', age: 2, pic: './Pic/איתי.webp', shortDescrip: 'פעוט סקרן ומלא שמחת חיים', description: `נבו הוא ילד קטן עם עיניים גדולות וסקרניות שמגלות עניין בכל מה שסביבו. הוא אוהב חקר וגילוי, במיוחד משחקי בנייה וצעצועים צבעוניים. נבו מתאים למשפחה שתשמח ללוות אותו בגילוי העולם, לעודד אותו ולהקנות לו תחושת ביטחון.`, budget: 3800 },
    { name: 'ליאו, קאי, טום וליאן', age: 1, pic: './Pic/רביעייה.webp', shortDescrip: 'רביעיית תינוקות מתוקים עם קשר ייחודי בינהם', description: `ליאו, קאי, טום וליאן הם רביעיית תינוקות בני שנה אחת בלבד, שנולדו למשפחה צעירה שעמדה בפני אתגר גדול בהרבה מיכולתה. ההורים ניסו ככל שיכלו, אך בעקבות הקושי הכלכלי, חוסר התמיכה והעומס הפיזי והנפשי בטיפול ברביעייה – הילדים נמסרו לטיפול המדינה עם לידתם.
    הם נמצאים כעת במסגרת טיפולית חמה ומחפשים בית שידע להכיל את הצרכים המיוחדים של טיפול ברביעיית תינוקות, עם הבנה לחשיבות החיבור ביניהם והיכולת ללוות אותם בדרך אל התפתחות בטוחה ובריאה.`, budget: 11000 },
    // { name: 'ליאם', age: 9, pic: './pic/3 (6).png', shortDescrip: 'ספורטיבי ושמח', description: 'מתעניין בכדורגל, אנרגטי ומלא חיים', budget: 7100 },
    // { name: 'יובל', age: 10, pic: './pic/3 (7).png', shortDescrip: 'אחראית ומכילה', description: 'בוגרת יחסית, אוהבת לעזור לאחרים', budget: 6900 },
    // { name: 'עדי', age: 6, pic: './pic/3 (8).png', shortDescrip: 'חולמת ומביטה רחוק', description: 'אוהבת שקט, סיפורים ודמיון מודרך', budget: 5400 },
    // { name: 'נבו', age: 5, pic: './pic/3 (9).png', shortDescrip: 'מלא אנרגיה', description: 'קופצני, סקרן, אוהב משחקי חצר וטיפוס', budget: 6000 },
    // { name: 'מאיה', age: 7, pic: './pic/3 (10).png', shortDescrip: 'מקשיבה מצוינת', description: 'אוהבת לשוחח, רגישה ונעימה לסביבה', budget: 7200 },
    // { name: 'שחר', age: 8, pic: './pic/3 (11).png', shortDescrip: 'מוזיקלי מאוד', description: 'מתופף, אוהב לשיר, מוזיקה מרגיעה אותו', budget: 6700 },
    // { name: 'תמר', age: 6, pic: './pic/3 (12).png', shortDescrip: 'חכמה ויצירתית', description: 'אוהבת תשבצים, ציור, כתיבה וקריאה', budget: 6800 },
    // { name: 'יונתן', age: 9, pic: './pic/3 (13).png', shortDescrip: 'מתעניין במדע', description: 'אוהב ניסויים, שאלות וחידות מתמטיות', budget: 7400 },
    // { name: 'אלה', age: 5, pic: './pic/3 (14).png', shortDescrip: 'עדינה ואוהבת חיות', description: 'רגישה מאוד, אוהבת חתולים וציור טבע', budget: 5900 },
    // { name: 'עמית', age: 7, pic: './pic/3 (15).png', shortDescrip: 'חולמני ושקט', description: 'קורא המון ספרים, מתחבר לסיפורים עתיקים', budget: 6300 },
    // { name: 'הילה', age: 6, pic: './pic/3 (16).png', shortDescrip: 'חברותית ונעימה', description: 'מתחברת לילדים במהירות, אוהבת לרקוד', budget: 7100 },
    // { name: 'גפן', age: 10, pic: './pic/3 (17).png', shortDescrip: 'יציבה ובוגרת', description: 'אחראית, שקטה, אוהבת סדר ודיוק', budget: 6200 },
    // { name: 'נועם', age: 4, pic: './pic/3 (18).png', shortDescrip: 'מצחיק ושובב', description: 'אוהב תיאטרון, חיקויים ומשחקים מצחיקים', budget: 6600 },
    // { name: 'אור', age: 6, pic: './pic/3 (19).png', shortDescrip: 'שואלת שאלות', description: 'מתעניינת במי ומה, אוהבת להבין ולהתבונן', budget: 7000 },
    // { name: 'אביתר', age: 8, pic: './pic/3 (20).png', shortDescrip: 'לומד מהר', description: 'שקט מאוד אבל חד אבחנה ומהיר תפיסה', budget: 7200 },
    // { name: 'טליה', age: 5, pic: './pic/3 (21).png', shortDescrip: 'מופנמת ונעימה', description: 'מתחברת דרך מבט, אוהבת לצפות ולצייר', budget: 6500 },
    // { name: 'אורי', age: 4, pic: './pic/3 (22).png', shortDescrip: 'טכנולוגי וחרוץ', description: 'מתעניין ברובוטים, בנייה ותכנות בסיסי', budget: 7300 },
    // { name: 'רוני', age: 6, pic: './pic/3 (23).png', shortDescrip: 'לב פתוח', description: 'מתחברת בקלות, אוהבת ריקוד ומשחקים קבוצתיים', budget: 6700 },
    // { name: 'זוהר', age: 3, pic: './pic/3 (24).png', shortDescrip: 'שקט עם עיניים חכמות', description: 'בעל חשיבה עמוקה, אוהב שקט ומרחב', budget: 6400 },
    // { name: 'דנה', age: 4, pic: './pic/3 (25).png', shortDescrip: 'יוצרת בכל חומר', description: 'מכינה יצירות מכל דבר – קרטון, צבע, בד', budget: 5800 },
    // { name: 'אליה', age: 5, pic: './pic/3 (26).png', shortDescrip: 'תנועתית מאוד', description: 'קופצת, רוקדת, זזה בלי הפסקה', budget: 7100 },
    // { name: 'מתן', age: 6, pic: './pic/3 (27).png', shortDescrip: 'מביא חיוך', description: 'חברותי מאוד, אוהב להצחיק', budget: 6900 },
    // { name: 'רז', age: 4, pic: './pic/3 (28).png', shortDescrip: 'תמיד מתעניין', description: 'שואל המון שאלות, רוצה לדעת על העולם', budget: 6400 },
    // { name: 'שירה', age: 5, pic: './pic/3 (29).png', shortDescrip: 'שקטה ומקשיבה', description: 'עדינה מאוד, אוהבת שירה רגועה וספרים', budget: 6000 },
    // { name: 'אייל', age: 6, pic: './pic/3 (30).png', shortDescrip: 'אנרגטי מאוד', description: 'צריך מרחב, אוהב שטח וחוץ', budget: 7500 }
    // { name: 'טליה', age: 5, pic: './pic/3 (21).png', shortDescrip: 'מופנמת ונעימה', description: 'מתחברת דרך מבט, אוהבת לצxxx ולצייר', budget: 6500 },
    // { name: 'אורי', age: 4, pic: './pic/3 (22).png', shortDescrip: 'טכנולוגי וחרוץ', description: 'מתעניין ברובוטים, בנייה ותכנות בסיסי', budget: 7300 },

]

//הכנסת מערך הילדים למחסנית
let childrenJson = JSON.stringify(children)
localStorage.setItem('detiles', childrenJson)
//יצירת מערך של ערכים המיוצר מהמחסנית
newChildren = JSON.parse(childrenJson)

//דריסת המשתמש האחרון והעדפות שלו
localStorage.setItem('user', '')
localStorage.setItem('likes', '[]')



// עיצוב אישי
localStorage.setItem('style', false)
localStorage.setItem('background', '')
localStorage.setItem('fontColor', '')
localStorage.setItem('fontFamily', '')


